{
    "name": "United States",
    "id": "united_states",
    "overview": "Each player represents a power company, which works to supply electricity to cities.  During the game, each player buys power plants at auction, buys resources to produce electricity in those power plants, and builds a network of cities to supply with electricity from his power plants. In the end, the player who supplies the most cities with power wins the game.",

    "limits": [
        { "players": 2, "regions": 3, "plants": 4, "remove": 8, "step2": 10, "endGame": 21 },
        { "players": 3, "regions": 3, "plants": 3, "remove": 8, "step2": 7, "endGame": 17 },
        { "players": 4, "regions": 4, "plants": 3, "remove": 4, "step2": 7, "endGame": 17 },
        { "players": 5, "regions": 5, "plants": 3, "remove": 0, "step2": 7, "endGame": 15 },
        { "players": 6, "regions": 6, "plants": 3, "remove": 0, "step2": 6, "endGame": 14 }
    ],

    "preparation": [
        {
            "players": [2, 3, 4, 5, 6],
            "step": [1, 2, 3],
            "content": "Place 3 coal on spaces 1 to 8; 3 oil on spaces 3 to 8; and 3 garbage on spaces 7 and 8; 1 uranium on each of the spaces 14 and 16."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": [1, 2, 3],
            "content": "Take the power plant cards numbered 03 to 10 and place them near the board in two rows.  In the upper row, place 03 to 06 in ascending order (actual market); in the lower row, place power plants numbered 07 to 10 in ascending order (future market). Keep market in ascending order as plants are added."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": [1, 2, 3],
            "content": "Remove the 'Step 3' card and plant number 13 from the card deck, shuffle the remaining power plant cards, and place them face down (plant supply). Place the 'Step 3' card face down under the stack and plant number 13 face down on top of the stack."
        }
    ],

    "turnOrder": [
        "Determine order",
        "Buy power plant",
        "Buy resources",
        "Build cities",
        "Bureaucracy"
    ],

    "payments": [
        10, 22, 33, 44, 54, 64, 73,
        82, 90, 98, 105, 112, 118, 124,
        129, 134, 138, 142, 145, 148, 150
    ],

    "restock": [
        { "players": 2, "step": 1, "coal": 3, "oil": 2, "trash": 1, "nuke": 1 },
        { "players": 2, "step": 2, "coal": 4, "oil": 2, "trash": 2, "nuke": 1 },
        { "players": 2, "step": 3, "coal": 3, "oil": 4, "trash": 3, "nuke": 1 },

        { "players": 3, "step": 1, "coal": 4, "oil": 2, "trash": 1, "nuke": 1 },
        { "players": 3, "step": 2, "coal": 5, "oil": 3, "trash": 2, "nuke": 1 },
        { "players": 3, "step": 3, "coal": 3, "oil": 4, "trash": 3, "nuke": 1 },

        { "players": 4, "step": 1, "coal": 5, "oil": 3, "trash": 2, "nuke": 1 },
        { "players": 4, "step": 2, "coal": 6, "oil": 4, "trash": 3, "nuke": 2 },
        { "players": 4, "step": 3, "coal": 4, "oil": 5, "trash": 4, "nuke": 2 },

        { "players": 5, "step": 1, "coal": 5, "oil": 4, "trash": 3, "nuke": 2 },
        { "players": 5, "step": 2, "coal": 7, "oil": 5, "trash": 3, "nuke": 3 },
        { "players": 5, "step": 3, "coal": 5, "oil": 6, "trash": 5, "nuke": 2 },

        { "players": 6, "step": 1, "coal": 7, "oil": 5, "trash": 3, "nuke": 2 },
        { "players": 6, "step": 2, "coal": 9, "oil": 6, "trash": 5, "nuke": 3 },
        { "players": 6, "step": 3, "coal": 6, "oil": 7, "trash": 6, "nuke": 3 }
    ],

    "notes": [
        {
            "players": [2, 3, 4, 5, 6],
            "step": [1, 2, 3],
            "content": "Every city can have only one house. The building cost for the first house is 10 Elektro."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": [1, 2, 3],
            "content": "In the first round of the game, each player must buy a power plant.  Players re-determine the player order after auctioning the power plants (after phase 2)."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": [1, 2, 3],
            "content": "If no power plant is sold in a round, the players remove the lowest numbered power plant from the market, placing it back in the box, and replace it by drawing a power plant from the draw stack. They then rearrange the market according to the rules."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": [1, 2, 3],
            "content": "If, at any time during the game, there is a power plant in the actual market with a number equal to or lower than the number of cities any player has, it is immediately removed from the game and replaced with a new card from the draw stack."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": 2,
            "content": "At the start of step 2, remove ONCE the lowest numbered power plant from the game and replace it with a new one from the draw stack, rearranging the market as always."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": 2,
            "content": "Two players can have houses in each city. The building price for the second connection is 15 Elektro."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": 2,
            "content": "If the 'Step 3' card is drawn in phase 2 (Auction Power Plants), treat the card as the highest power plant and place it at the end of the future market. Immediately shuffle the draw stack with the remaining power plants (the power plants that were placed under the draw stack during steps 1 and 2 of the game), and place it face down next to the game board. Continue the auction of power plants and draw replacements as necessary until all players have their chance to buy a new power plant or pass. After finishing phase 2, remove the lowest numbered power plant and the 'Step 3' card from the market and do not draw replacements! Step 3 starts in phase 3."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": 2,
            "content": "If the 'Step 3' card is drawn in phase 4 (Building) for replacements of too small power plants, remove this card and the smallest numbered power plant from the game and do not draw replacements. Shuffle the draw stack with the remaining power plants and place it face down next to the game board. Step 3 starts in phase 5."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": 2,
            "content": "If the 'Step 3' card is drawn in phase 5 (Bureaucracy), remove this card and the lowest numbered power plant from the game and do not draw replacements. Shuffle the draw stack with the remaining power plants and place it face down next to the game board. Use the re-supply of resources for Step 2 a final time. Step 3 starts in phase 1 of the next turn."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": 3,
            "content": "During step 3, there are only 6 power plants in the power plant market and all of these power plants are in the actual market and are available to be auctioned."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": 3,
            "content": "Every city can have three houses. The building price for the third house is 20 Elektro."
        },

        {
            "players": [2, 3, 4, 5, 6],
            "step": 3,
            "content": "In phase 5, remove the smallest numbered power plant from the game and draw a replacement from the draw stack. During the last rounds of the game, it is possible that the draw stack becomes exhausted. The game continues and in each phase 5, the players remove the smallest numbered power plant. It is possible to run out of power plants if this goes on for several rounds."
        }
    ]
}
